000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаСотрудниковКоллЦентра/РаботаСотрудниковКоллЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботаСотрудниковКоллЦентра</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НовыеЗаказы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработанныеЗаказы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиКоллЦентра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаСотрудниковКоллЦентра/ManagerModule.bsl
Функция ПолучитьСотрудникаПоВнутренниемуНомеру(ВнутреннийНомер) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботаСотрудниковКоллЦентра.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
	|ГДЕ
	|	РаботаСотрудниковКоллЦентра.НаРаботе = ИСТИНА
	|	И РаботаСотрудниковКоллЦентра.ВнутреннийНомер = &ВнутреннийНомер
	|	И РаботаСотрудниковКоллЦентра.Период = &Период";
	Запрос.УстановитьПараметр("ВнутреннийНомер", СокрЛП(ВнутреннийНомер)); //Строка 
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата())); //Строка 
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Сотрудник;	
	Иначе 
		Возврат Справочники.СотрудникиКоллЦентра.ПустаяСсылка();	
	КонецЕсли;	
	
КонецФункции
